notebook/git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-21 Thu 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GIT 笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Saul Lawliet" />
<link rel="stylesheet" href="/assets/css/org.css" type="text/css" />
<link rel="stylesheet" href="https://saullawliet.github.io/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">GIT 笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3190272">获得帮助</a></li>
<li><a href="#org18a5a6b">全局设置</a></li>
<li><a href="#org3a0216d">基本操作</a>
<ul>
<li><a href="#org25d6805">Initialize</a>
<ul>
<li><a href="#org1c75dcf">1. Local Repository -&gt; Workspace</a></li>
<li><a href="#org43a76d5">2. Remote Repository -&gt; Workspace</a></li>
</ul>
</li>
<li><a href="#org93ae948">Update</a>
<ul>
<li><a href="#org24f5dc8">3. Remote Repository -&gt; Workspace</a></li>
<li><a href="#orgda18305">4. Remote Repository -&gt; Local Repository</a></li>
</ul>
</li>
<li><a href="#orga073b76">Changes</a>
<ul>
<li><a href="#org662a6d3">5. Workspace -&gt; Staging</a></li>
<li><a href="#orgd9325e2">6. Staging -&gt; Local Repository</a></li>
<li><a href="#orgc76d025">7. Workspace -&gt; Local Repository</a></li>
<li><a href="#org6c6a950">8. Local Repository -&gt; Remote Repository</a></li>
</ul>
</li>
<li><a href="#orgf1d5b79">Revert</a>
<ul>
<li><a href="#orgf83b6ad">9. Local Repository -&gt; Staging</a></li>
<li><a href="#orgf7d396e">10. Staging -&gt; Workspace</a></li>
<li><a href="#orgaef3b3e">11. Local Repository -&gt; Workspace</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgacf7d3b">其他操作</a>
<ul>
<li><a href="#orga83a863">Diff</a></li>
<li><a href="#org5926ec9">Log</a></li>
<li><a href="#org09983bf">Branch</a></li>
<li><a href="#org8317542">Tag</a></li>
</ul>
</li>
<li><a href="#org55a1d47">参考</a></li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org3190272" class="outline-2">
<h2 id="org3190272">获得帮助</h2>
<div class="outline-text-2" id="text-org3190272">
<pre class="example">
$ git help

# 获取指定命令的帮助
$ git help &lt;command&gt;
</pre>
</div>
</div>

<div id="outline-container-org18a5a6b" class="outline-2">
<h2 id="org18a5a6b">全局设置</h2>
<div class="outline-text-2" id="text-org18a5a6b">
<pre class="example">
$ git config --global user.name "saul"
$ git config --global user.email "saul@example.com"
$ git config --global color.ui true
</pre>
</div>
</div>

<div id="outline-container-org3a0216d" class="outline-2">
<h2 id="org3a0216d">基本操作</h2>
<div class="outline-text-2" id="text-org3a0216d">
<p>
workflow:
</p>
<pre class="example">
	    +-----------+   +-----------+   +------------+   +------------+
	    |           |   |           |   |   Local    |   |   Remote   |
	    | Workspace |   |  Staging  |   | Repository |   | Repository |
	    +-----------+   +-----------+   +------------+   +------------+
		  |               |               |                 |
Initialize        |&lt;--(1)-------------------------|                 |
		  |&lt;--(2)-------------------------------------------|
		  |               |               |                 |
		  |               |               |                 |
    Update        |&lt;--(3)-------------------------------------------|
		  |               |               |&lt;--(4)-----------|
		  |               |               |                 |
		  |               |               |                 |
   Changes        |---------(5)--&gt;|               |                 |
		  |               |---------(6)--&gt;|                 |
		  |-------------------------(7)--&gt;|                 |
		  |               |               |-----------(8)--&gt;|
		  |               |               |                 |
		  |               |               |                 |
    Revert        |               |&lt;--(9)---------|                 |
		  |&lt;--(10)--------|               |                 |
		  |&lt;--(11)------------------------|                 |
		  |               |               |                 |
</pre>
</div>

<div id="outline-container-org25d6805" class="outline-3">
<h3 id="org25d6805">Initialize</h3>
<div class="outline-text-3" id="text-org25d6805">
</div>
<div id="outline-container-org1c75dcf" class="outline-4">
<h4 id="org1c75dcf">1. Local Repository -&gt; Workspace</h4>
<div class="outline-text-4" id="text-org1c75dcf">
<pre class="example">
# 不指定 &lt;directory&gt; 时指当前目录
$ git init [&lt;directory&gt;]
</pre>
</div>
</div>

<div id="outline-container-org43a76d5" class="outline-4">
<h4 id="org43a76d5">2. Remote Repository -&gt; Workspace</h4>
<div class="outline-text-4" id="text-org43a76d5">
<pre class="example">
$ git clone &lt;url of remote repository&gt; [&lt;directory&gt;]
</pre>
</div>
</div>
</div>

<div id="outline-container-org93ae948" class="outline-3">
<h3 id="org93ae948">Update</h3>
<div class="outline-text-3" id="text-org93ae948">
</div>
<div id="outline-container-org24f5dc8" class="outline-4">
<h4 id="org24f5dc8">3. Remote Repository -&gt; Workspace</h4>
<div class="outline-text-4" id="text-org24f5dc8">
<pre class="example">
$ git pull
</pre>
</div>
</div>

<div id="outline-container-orgda18305" class="outline-4">
<h4 id="orgda18305">4. Remote Repository -&gt; Local Repository</h4>
<div class="outline-text-4" id="text-orgda18305">
<pre class="example">
$ git fetch
</pre>
</div>
</div>
</div>

<div id="outline-container-orga073b76" class="outline-3">
<h3 id="orga073b76">Changes</h3>
<div class="outline-text-3" id="text-orga073b76">
</div>
<div id="outline-container-org662a6d3" class="outline-4">
<h4 id="org662a6d3">5. Workspace -&gt; Staging</h4>
<div class="outline-text-4" id="text-org662a6d3">
<pre class="example">
$ git add &lt;./dir/file&gt;...
</pre>
</div>
</div>

<div id="outline-container-orgd9325e2" class="outline-4">
<h4 id="orgd9325e2">6. Staging -&gt; Local Repository</h4>
<div class="outline-text-4" id="text-orgd9325e2">
<pre class="example">
$ git commit -m &lt;message&gt;
</pre>
</div>
</div>

<div id="outline-container-orgc76d025" class="outline-4">
<h4 id="orgc76d025">7. Workspace -&gt; Local Repository</h4>
<div class="outline-text-4" id="text-orgc76d025">
<pre class="example">
# 不会提交 untracked 文件
$ git commit -a -m &lt;message&gt;

# 跟上一次的提交合并, 覆盖 message, 同样不会提交 untracked 文件
$ git commit --amend -m &lt;message&gt;
</pre>
</div>
</div>

<div id="outline-container-org6c6a950" class="outline-4">
<h4 id="org6c6a950">8. Local Repository -&gt; Remote Repository</h4>
<div class="outline-text-4" id="text-org6c6a950">
<pre class="example">
$ git push [-u &lt;name&gt; &lt;branch&gt;]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1d5b79" class="outline-3">
<h3 id="orgf1d5b79">Revert</h3>
<div class="outline-text-3" id="text-orgf1d5b79">
</div>
<div id="outline-container-orgf83b6ad" class="outline-4">
<h4 id="orgf83b6ad">9. Local Repository -&gt; Staging</h4>
<div class="outline-text-4" id="text-orgf83b6ad">
<pre class="example">
# 撤销上次提交, 将所有的改动放到 Staging
$ git reset --soft HEAD^
</pre>
</div>
</div>

<div id="outline-container-orgf7d396e" class="outline-4">
<h4 id="orgf7d396e">10. Staging -&gt; Workspace</h4>
<div class="outline-text-4" id="text-orgf7d396e">
<pre class="example">
# 将文件状态从 Staging 移出, 不指定 &lt;file&gt; 时表示所有在 Staging 的文件
$ git reset HEAD [&lt;file&gt;...]

# 丢弃在 Workspace 中的文件改动
$ git checkout -- &lt;file&gt;...
</pre>
</div>
</div>

<div id="outline-container-orgaef3b3e" class="outline-4">
<h4 id="orgaef3b3e">11. Local Repository -&gt; Workspace</h4>
<div class="outline-text-4" id="text-orgaef3b3e">
<pre class="example">
# 撤销上次的提交以及所有的改动(慎用)
$ git reset --hard HEAD^
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgacf7d3b" class="outline-2">
<h2 id="orgacf7d3b">其他操作</h2>
<div class="outline-text-2" id="text-orgacf7d3b">
</div>
<div id="outline-container-orga83a863" class="outline-3">
<h3 id="orga83a863">Diff</h3>
<div class="outline-text-3" id="text-orga83a863">
<pre class="example">
# unstaged 与 last commit 比较
$ git diff [&lt;file&gt;]

# staged 与 last commit 比较
$ git diff --staged [&lt;file&gt;]

$ git diff HEAD
$ git diff HEAD^
$ git diff HEAD~5
$ git diff HEAD^..HEAD
$ git diff &lt;long_hash&gt;..&lt;long_hash&gt;
$ git diff &lt;short_hash&gt;..&lt;short_hash&gt;
$ git diff &lt;branch1&gt; &lt;branch2&gt;
$ git diff --since=1.week.ago --until=1.minute.ago
</pre>
</div>
</div>

<div id="outline-container-org5926ec9" class="outline-3">
<h3 id="org5926ec9">Log</h3>
<div class="outline-text-3" id="text-org5926ec9">
<pre class="example">
$ git log
$ git log --pretty=oneline
$ git log --oneline
$ git log --oneline -p
$ git log --oneline --stat
$ git log --oneline --graph
$ git log --until=1.minute.ago
$ git log --since=1.day.ago
$ git log --since=1.hour.ago
$ git log --since=1.month.ago --until=2.weeks.ago
$ git log --since=2000-01-01 --until=2012-12-21
</pre>
</div>
</div>

<div id="outline-container-org09983bf" class="outline-3">
<h3 id="org09983bf">Branch</h3>
<div class="outline-text-3" id="text-org09983bf">
<pre class="example">
$ git branch               # 列出分支
$ git branch -r            # 列出远程分支
$ git branch &lt;branch&gt;      # 创建分支
$ git branch -d &lt;branch&gt;   # 删除分支
$ git push origin :cat     # 删除远程的分支

$ git checkout &lt;branch&gt;    # 切换分支
$ git checkout -b &lt;branch&gt; # 创建并切换分支

</pre>
</div>
</div>

<div id="outline-container-org8317542" class="outline-3">
<h3 id="org8317542">Tag</h3>
<div class="outline-text-3" id="text-org8317542">
<pre class="example">
$ git tag                   # 列出标签
$ git checkout &lt;tag&gt;        # 切换标签
$ git tag -a &lt;tag&gt; -m &lt;msg&gt; # 新建标签
$ git push --tags           # push
</pre>
</div>
</div>
</div>
<div id="outline-container-org55a1d47" class="outline-2">
<h2 id="org55a1d47">参考</h2>
<div class="outline-text-2" id="text-org55a1d47">
<ol class="org-ol">
<li><a href="https://www.codeschool.com/courses/git-real">Code School - Git Real</a></li>
<li><a href="https://sselab.de/lab2/public/wiki/sselab/index.php?title=Git">https://sselab.de/lab2/public/wiki/sselab/index.php?title=Git</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2019-03-21 Thu 16:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
